doom.d/config.el

(setq user-full-name "Holger Berndt"
      user-mail-address "hberndt@bidcore.de")

(setq confirm-kill-emacs nil)
